pmo-dataset/variations/graphviz_with_ids/03.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Update inventory\nlevels"];
  "Task_2" [label="Update inventory\nsystem with expected\ndelivery dates"];
  "Task_3" [label="Inspect stock for\nquality"];
  "Task_4" [label="Place order with\nsuppliers"];
  "Task_5" [label="Receive stock"];
  "Task_6" [label="Place stock on\nshelves"];
  "Task_7" [label="Check current\ninventory level"];
  "Task_8" [label="Send a manual alert"];
  "Task_9" [label="Send an automated\nalert"];
  "Task_10" [label="Place stock in\nstorage"];
  "Task_11" [label="Record stock in\nsystem"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "Task_6" -> "ExclusiveGateway_6";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "ExclusiveGateway_6" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ExclusiveGateway_1";
  "ExclusiveGateway_4" -> "Task_8";
  "Task_10" -> "ExclusiveGateway_6";
  "Task_7" -> "ExclusiveGateway_3";
  "ExclusiveGateway_4" -> "Task_9";
  "Task_3" -> "ExclusiveGateway_2";
  "Task_5" -> "ParallelGateway_1";
  "Task_11" -> "ParallelGateway_2";
  "Task_8" -> "ExclusiveGateway_5";
  "Task_2" -> "Task_5";
  "ParallelGateway_2" -> "Task_1";
  "ExclusiveGateway_2" -> "Task_6";
  "ExclusiveGateway_2" -> "Task_10";
  "Task_4" -> "Task_2";
  "StartNoneEvent_1" -> "ExclusiveGateway_1";
  "Task_1" -> "EndNoneEvent_1";
  "ParallelGateway_1" -> "Task_11";
  "ExclusiveGateway_5" -> "Task_4";
  "ParallelGateway_1" -> "Task_3";
  "ExclusiveGateway_1" -> "Task_7";
  "Task_9" -> "ExclusiveGateway_5";
}
